In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('employee_info.xlsx')
df.head()

              Name  Employee ID  Salary Full Time/Part Time
0      Asa Eviatar       500123   64500           Full Time
1   Baako Chijioke       500397   60000           Full Time
2  Cordell Rumiana       500874   35500           Part Time
3   Fariha Fahmida       500971   68500           Full Time
4     Fazl Fairuza       500517   37500           Part Time

In [4]:
pd.get_dummies(df['Full Time/Part Time'],drop_first=True)

    Part Time
0           0
1           0
2           1
3           0
4           1
5           0
6           1
7           0
8           0
9           1
10          1
11          0
12          1
13          0

# **References and Additional Learning**

## **Website**

- **[pandas.get_dummies](https://pandas.pydata.org/docs/reference/api/pandas.get_dummies.html) from pandas.pydata.org**

# **Connect**
- **Feel free to connect with Adrian on [YouTube](https://www.youtube.com/channel/UCPuDxI3xb_ryUUMfkm0jsRA), [LinkedIn](https://www.linkedin.com/in/adrian-dolinay-frm-96a289106/), [Twitter](https://twitter.com/DolinayG), [GitHub](https://github.com/ad17171717) and [Odysee](https://odysee.com/@adriandolinay:0). Happy coding!**